## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.nsg-test will be created
  + resource "azurerm_network_security_group" "nsg-test" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "vmtest-nsg"
      + resource_group_name = "rgtest2"
      + security_rule       = (known after apply)
    }

  # azurerm_public_ip.pip-test will be created
  + resource "azurerm_public_ip" "pip-test" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "vmtest-ip"
      + resource_group_name     = "rgtest2"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.rg-test will be created
  + resource "azurerm_resource_group" "rg-test" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rgtest2"
    }

  # azurerm_subnet.subnet-test will be created
  + resource "azurerm_subnet" "subnet-test" {
      + address_prefixes                               = [
          + "10.0.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "default"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rgtest2"
      + virtual_network_name                           = "vnet-test"
    }

  # azurerm_virtual_network.vnet-test will be created
  + resource "azurerm_virtual_network" "vnet-test" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "vnet-test"
      + resource_group_name = "rgtest2"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>